VMs/Results/NoFirewall/Fio/results_1.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43845: Tue Dec 10 18:51:27 2024
  read: IOPS=1477, BW=5910KiB/s (6052kB/s)(1731MiB/300001msec)
    slat (usec): min=10, max=21636, avg=229.82, stdev=505.18
    clat (usec): min=3, max=16744, avg=361.21, stdev=510.22
     lat (usec): min=15, max=21675, avg=639.23, stdev=743.27
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   20], 40.00th=[  277], 50.00th=[  314], 60.00th=[  351],
     | 70.00th=[  396], 80.00th=[  478], 90.00th=[  685], 95.00th=[  996],
     | 99.00th=[ 2540], 99.50th=[ 3392], 99.90th=[ 5669], 99.95th=[ 6652],
     | 99.99th=[ 9110]
   bw (  KiB/s): min= 2949, max= 8880, per=25.73%, avg=5916.31, stdev=1106.65, samples=599
   iops        : min=  737, max= 2220, avg=1478.85, stdev=276.65, samples=599
  lat (usec)   : 4=0.04%, 10=21.13%, 20=8.89%, 50=2.23%, 100=0.76%
  lat (usec)   : 250=1.32%, 500=47.29%, 750=9.85%, 1000=3.55%
  lat (msec)   : 2=3.30%, 4=1.33%, 10=0.31%, 20=0.01%
  cpu          : usr=5.39%, sys=34.62%, ctx=492045, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=443232,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43846: Tue Dec 10 18:51:27 2024
  read: IOPS=1418, BW=5676KiB/s (5812kB/s)(1663MiB/300001msec)
    slat (usec): min=10, max=17170, avg=233.20, stdev=516.91
    clat (usec): min=3, max=14431, avg=378.02, stdev=540.46
     lat (usec): min=16, max=17203, avg=665.47, stdev=777.12
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   22], 40.00th=[  277], 50.00th=[  318], 60.00th=[  351],
     | 70.00th=[  404], 80.00th=[  502], 90.00th=[  742], 95.00th=[ 1090],
     | 99.00th=[ 2737], 99.50th=[ 3621], 99.90th=[ 5800], 99.95th=[ 6849],
     | 99.99th=[ 9241]
   bw (  KiB/s): min= 2355, max= 9648, per=24.71%, avg=5681.71, stdev=1078.65, samples=599
   iops        : min=  588, max= 2412, avg=1420.21, stdev=269.67, samples=599
  lat (usec)   : 4=0.03%, 10=20.09%, 20=9.35%, 50=2.60%, 100=0.82%
  lat (usec)   : 250=1.32%, 500=45.65%, 750=10.47%, 1000=3.98%
  lat (msec)   : 2=3.79%, 4=1.54%, 10=0.36%, 20=0.01%
  cpu          : usr=5.02%, sys=34.16%, ctx=482950, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=425677,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43847: Tue Dec 10 18:51:27 2024
  read: IOPS=1414, BW=5657KiB/s (5793kB/s)(1657MiB/300001msec)
    slat (usec): min=11, max=15869, avg=232.44, stdev=511.48
    clat (usec): min=3, max=13652, avg=378.91, stdev=538.70
     lat (usec): min=16, max=15903, avg=667.26, stdev=777.91
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   22], 40.00th=[  277], 50.00th=[  318], 60.00th=[  351],
     | 70.00th=[  404], 80.00th=[  506], 90.00th=[  742], 95.00th=[ 1090],
     | 99.00th=[ 2737], 99.50th=[ 3621], 99.90th=[ 5735], 99.95th=[ 6783],
     | 99.99th=[ 8848]
   bw (  KiB/s): min= 3008, max= 8383, per=24.62%, avg=5662.78, stdev=1038.50, samples=599
   iops        : min=  752, max= 2095, avg=1415.46, stdev=259.61, samples=599
  lat (usec)   : 4=0.02%, 10=19.36%, 20=9.99%, 50=2.46%, 100=0.90%
  lat (usec)   : 250=1.30%, 500=45.75%, 750=10.44%, 1000=4.07%
  lat (msec)   : 2=3.78%, 4=1.55%, 10=0.36%, 20=0.01%
  cpu          : usr=4.98%, sys=34.26%, ctx=482652, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=424295,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43848: Tue Dec 10 18:51:27 2024
  read: IOPS=1438, BW=5752KiB/s (5891kB/s)(1685MiB/300001msec)
    slat (usec): min=10, max=17325, avg=227.51, stdev=503.16
    clat (usec): min=3, max=11933, avg=373.81, stdev=532.52
     lat (usec): min=15, max=17366, avg=656.30, stdev=767.52
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   21], 40.00th=[  277], 50.00th=[  318], 60.00th=[  351],
     | 70.00th=[  400], 80.00th=[  494], 90.00th=[  725], 95.00th=[ 1057],
     | 99.00th=[ 2671], 99.50th=[ 3589], 99.90th=[ 5866], 99.95th=[ 6849],
     | 99.99th=[ 9110]
   bw (  KiB/s): min= 2813, max= 8960, per=25.04%, avg=5758.52, stdev=1079.43, samples=599
   iops        : min=  703, max= 2240, avg=1439.42, stdev=269.90, samples=599
  lat (usec)   : 4=0.03%, 10=19.80%, 20=9.75%, 50=2.24%, 100=0.83%
  lat (usec)   : 250=1.30%, 500=46.37%, 750=10.33%, 1000=3.92%
  lat (msec)   : 2=3.60%, 4=1.45%, 10=0.36%, 20=0.01%
  cpu          : usr=5.25%, sys=34.21%, ctx=484406, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=431437,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.5MiB/s (23.5MB/s), 5657KiB/s-5910KiB/s (5793kB/s-6052kB/s), io=6737MiB (7064MB), run=300001-300001msec

Disk stats (read/write):
  dm-0: ios=1429789/0, merge=0/0, ticks=338120/0, in_queue=338120, util=100.00%

Disk stats (read/write):
  sda: ios=1430819/0, merge=0/0, ticks=341900/0, in_queue=341900, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 18:51:27 2024
  read: IOPS=5748, BW=22.5Mi (23.5M)(6737MiB/300001msec)
    slat (usec): min=10, max=21636, avg=231.59, stdev=440.05
    clat (usec): min=3, max=16744, avg=377.18, stdev=463.07
     lat (usec): min=15, max=21675, avg=663.62, stdev=667.33
   bw (  KiB/s): min= 8176, max=26991, per=18.59%, avg=17103.01, stdev=1065.11, samples=1797
   iops        : min= 2043, max= 6747, avg=4275.09, stdev=266.29, samples=1797
  lat (usec)   : 4=0.03%, 10=20.11%, 20=9.49%, 50=2.38%, 100=0.83%
  lat (usec)   : 250=1.31%, 500=46.28%, 750=10.27%, 1000=3.88%
  lat (msec)   : 2=3.61%, 4=1.47%, 10=0.35%, 20=0.01%
  cpu          : usr=5.16%, sys=34.31%, ctx=1942053, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1724641,0,0,0 short=0,0,0,0 dropped=0,0,0,0