VMs/Results/NoFirewall/Fio/results_2.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43854: Tue Dec 10 19:07:05 2024
  read: IOPS=1483, BW=5934KiB/s (6076kB/s)(1738MiB/300001msec)
    slat (usec): min=11, max=19010, avg=225.48, stdev=496.56
    clat (usec): min=3, max=15734, avg=360.38, stdev=508.21
     lat (usec): min=16, max=19067, avg=636.68, stdev=738.86
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   20], 40.00th=[  277], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  474], 90.00th=[  693], 95.00th=[ 1004],
     | 99.00th=[ 2540], 99.50th=[ 3425], 99.90th=[ 5604], 99.95th=[ 6521],
     | 99.99th=[ 9110]
   bw (  KiB/s): min= 3006, max= 9082, per=25.49%, avg=5939.53, stdev=1172.50, samples=599
   iops        : min=  751, max= 2270, avg=1484.68, stdev=293.11, samples=599
  lat (usec)   : 4=0.05%, 10=20.25%, 20=9.75%, 50=2.21%, 100=0.79%
  lat (usec)   : 250=1.44%, 500=47.19%, 750=9.70%, 1000=3.60%
  lat (msec)   : 2=3.35%, 4=1.33%, 10=0.32%, 20=0.01%
  cpu          : usr=5.24%, sys=34.59%, ctx=495454, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=445019,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43855: Tue Dec 10 19:07:05 2024
  read: IOPS=1438, BW=5755KiB/s (5893kB/s)(1686MiB/300001msec)
    slat (usec): min=10, max=14998, avg=224.84, stdev=498.80
    clat (usec): min=3, max=11871, avg=375.26, stdev=522.82
     lat (usec): min=16, max=17718, avg=656.15, stdev=758.74
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   23], 40.00th=[  277], 50.00th=[  314], 60.00th=[  351],
     | 70.00th=[  400], 80.00th=[  502], 90.00th=[  734], 95.00th=[ 1074],
     | 99.00th=[ 2638], 99.50th=[ 3490], 99.90th=[ 5735], 99.95th=[ 6652],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 3160, max= 8806, per=24.73%, avg=5763.24, stdev=1059.21, samples=599
   iops        : min=  790, max= 2201, avg=1440.60, stdev=264.80, samples=599
  lat (usec)   : 4=0.01%, 10=19.75%, 20=9.41%, 50=2.31%, 100=0.81%
  lat (usec)   : 250=1.31%, 500=46.26%, 750=10.57%, 1000=4.02%
  lat (msec)   : 2=3.71%, 4=1.51%, 10=0.32%, 20=0.01%
  cpu          : usr=5.27%, sys=33.97%, ctx=486290, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=431603,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43856: Tue Dec 10 19:07:05 2024
  read: IOPS=1451, BW=5807KiB/s (5946kB/s)(1701MiB/300001msec)
    slat (usec): min=10, max=15143, avg=229.54, stdev=508.49
    clat (usec): min=3, max=13121, avg=369.19, stdev=525.12
     lat (usec): min=16, max=16061, avg=650.34, stdev=760.15
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   21], 40.00th=[  277], 50.00th=[  314], 60.00th=[  347],
     | 70.00th=[  396], 80.00th=[  490], 90.00th=[  717], 95.00th=[ 1037],
     | 99.00th=[ 2638], 99.50th=[ 3523], 99.90th=[ 5735], 99.95th=[ 6783],
     | 99.99th=[ 8979]
   bw (  KiB/s): min= 3129, max= 9760, per=24.95%, avg=5813.79, stdev=1081.32, samples=599
   iops        : min=  782, max= 2440, avg=1453.22, stdev=270.34, samples=599
  lat (usec)   : 4=0.02%, 10=19.14%, 20=10.63%, 50=2.25%, 100=0.82%
  lat (usec)   : 250=1.40%, 500=46.34%, 750=10.18%, 1000=3.93%
  lat (msec)   : 2=3.53%, 4=1.40%, 10=0.35%, 20=0.01%
  cpu          : usr=5.17%, sys=34.31%, ctx=488881, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=435516,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43857: Tue Dec 10 19:07:05 2024
  read: IOPS=1451, BW=5806KiB/s (5945kB/s)(1701MiB/300001msec)
    slat (usec): min=10, max=15220, avg=241.18, stdev=530.21
    clat (usec): min=3, max=11578, avg=360.57, stdev=506.98
     lat (usec): min=15, max=15520, avg=651.41, stdev=755.24
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   20], 40.00th=[  273], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  482], 90.00th=[  701], 95.00th=[  996],
     | 99.00th=[ 2507], 99.50th=[ 3392], 99.90th=[ 5669], 99.95th=[ 6652],
     | 99.99th=[ 8455]
   bw (  KiB/s): min= 2869, max= 9552, per=24.93%, avg=5810.37, stdev=1008.76, samples=599
   iops        : min=  717, max= 2388, avg=1452.38, stdev=252.20, samples=599
  lat (usec)   : 4=0.04%, 10=20.76%, 20=9.66%, 50=2.08%, 100=0.76%
  lat (usec)   : 250=1.33%, 500=46.45%, 750=10.13%, 1000=3.79%
  lat (msec)   : 2=3.36%, 4=1.32%, 10=0.31%, 20=0.01%
  cpu          : usr=5.22%, sys=34.42%, ctx=488414, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=435454,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.8MiB/s (23.9MB/s), 5755KiB/s-5934KiB/s (5893kB/s-6076kB/s), io=6827MiB (7158MB), run=300001-300001msec

Disk stats (read/write):
  dm-0: ios=1449706/5, merge=0/0, ticks=337560/0, in_queue=337560, util=100.00%

Disk stats (read/write):
  sda: ios=1449831/4, merge=0/1, ticks=341136/2, in_queue=341139, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 19:07:05 2024
  read: IOPS=5825, BW=22.8Mi (23.9M)(6827MiB/300001msec)
    slat (usec): min=10, max=19010, avg=230.08, stdev=442.69
    clat (usec): min=3, max=15734, avg=370.09, stdev=447.55
     lat (usec): min=15, max=19067, avg=653.52, stdev=654.45
   bw (  KiB/s): min= 9158, max=28118, per=18.65%, avg=17387.40, stdev=1049.62, samples=1797
   iops        : min= 2289, max= 7029, avg=4346.20, stdev=262.41, samples=1797
  lat (usec)   : 4=0.03%, 10=19.98%, 20=9.86%, 50=2.21%, 100=0.80%
  lat (usec)   : 250=1.37%, 500=46.56%, 750=10.14%, 1000=3.83%
  lat (msec)   : 2=3.49%, 4=1.39%, 10=0.33%, 20=0.01%
  cpu          : usr=5.23%, sys=34.32%, ctx=1959039, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1747592,0,0,0 short=0,0,0,0 dropped=0,0,0,0